[
    {
        "id": "90",
        "name": "The Mule",
        "description": "The Mule is a central character in Foundation and Empire (1952) and Second Foundation (1953). Foundation's Edge (1982) retcons his origin, stating that he originally came from the planet Gaia, but was regarded as an aberration on a world where mental powers were being developed for benevolent ends. His childhood was one of torment and alienation. The Mule becomes aware of his great mental powers in his twenties and develops a desire to compensate for his earlier life by dominating humanity. No indication is ever given of any other names for him besides \"The Mule\", a name he apparently gave himself, \"Magnifico Giganticus\", an alias he takes up to travel among Foundationers, and his statement as Magnifico that his name used to be \"Bobo\""
    },
    {
        "id": "92",
        "name": "Hari Seldon",
        "description": "Hari Seldon is the founder of the two Foundations. He is a psycho-historian who, through the calculations of psycho-history, predicts the downfall of 'The Empire' and a potential 30,000-year interregnum. He sets up the First and Second Foundations to reduce this huge gap from 30,000 years down to 1000 years. Following a trial, Hari Seldon and his 100,000 followers are exiled to the planet Terminus where the First Foundation is set up. Unknown to many, a Second Foundation is set up at a separate location. Clues to its existence come from a statement by Hari Seldon of it being at 'Star's End'. Many searches are made for this and several of the characters have their own theories about where this is."
    },
    {
        "id": "93",
        "name": "Frodo Baggins",
        "description": "Frodo Baggins is a fictional character in J. R. R. Tolkien's writings, and one of the protagonists in The Lord of the Rings. Frodo is a hobbit of the Shire who inherits the One Ring from his cousin Bilbo Baggins and undertakes the quest to destroy it in the fires of Mount Doom in Mordor. He is mentioned in Tolkien's posthumously published works, The Silmarillion and Unfinished Tales."
    },
    {
        "id": "94",
        "name": "Bilbo Baggins",
        "description": "Bilbo Baggins is the title character and protagonist of J. R. R. Tolkien's 1937 novel The Hobbit, a supporting character in The Lord of the Rings, and the fictional narrator (along with Frodo Baggins) of many of Tolkien's Middle-earth writings. The Hobbit is selected by the wizard Gandalf to help Thorin and his party of Dwarves to reclaim their ancestral home and treasure, which has been seized by the dragon Smaug. Bilbo sets out in The Hobbit timid and comfort-loving, and through his adventures grows to become a useful and resourceful member of the quest."
    },
    {
        "id": "95",
        "name": "Gandalf the Grey",
        "description": "Gandalf is a protagonist in J. R. R. Tolkien's novels The Hobbit and The Lord of the Rings. He is a wizard, one of the Istari order, and the leader and mentor of the Fellowship of the Ring. Tolkien took the name \"Gandalf\" from the Old Norse \"Catalogue of Dwarves\" (Dvergatal) in the Völuspá. "
    }
]
